adFVM/tests/cylinder/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 6.4e-4;

vertices #codeStream
{
    codeInclude
    #{
        #include "pointField.H"
    #};

    code
    #{
        pointField points(19);
        points[0]  = point(0.5, 0, -0.5);
        points[1]  = point(1, 0, -0.5);
        points[2]  = point(10, 0, -0.5);
        points[3]  = point(10, 0.707107, -0.5);
        points[4]  = point(0.707107, 0.707107, -0.5);
        points[5]  = point(0.353553, 0.353553, -0.5);
        points[6]  = point(10, 10, -0.5);
        points[7]  = point(0.707107, 10, -0.5);
        points[8]  = point(0, 10, -0.5);
        points[9]  = point(0, 1, -0.5);
        points[10] = point(0, 0.5, -0.5);
        points[11] = point(-0.5, 0, -0.5);
        points[12] = point(-1, 0, -0.5);
        points[13] = point(-10, 0, -0.5);
        points[14] = point(-10, 0.707107, -0.5);
        points[15] = point(-0.707107, 0.707107, -0.5);
        points[16] = point(-0.353553, 0.353553, -0.5);
        points[17] = point(-10, 10, -0.5);
        points[18] = point(-0.707107, 10, -0.5);

        // Duplicate z points
        label sz = points.size();
        points.setSize(2*sz);
        for (label i = 0; i < sz; i++)
        {
            const point& pt = points[i];
            points[i+sz] = point(pt.x(), pt.y(), -pt.z());
        }

        os  << points;
    #};
};


blocks
(
    hex (5 4 9 10 24 23 28 29) (20 10 1) simpleGrading (10 1 1)
    hex (0 1 4 5 19 20 23 24) (20 10 1) simpleGrading (10 1 1)
    hex (1 2 3 4 20 21 22 23) (100 10 1) simpleGrading (1 1 1)
    hex (4 3 6 7 23 22 25 26) (100 100 1) simpleGrading (1 1 1)
    hex (9 4 7 8 28 23 26 27) (10 100 1) simpleGrading (1 1 1)
    hex (15 16 10 9 34 35 29 28) (20 10 1) simpleGrading (0.1 1 1)
    hex (12 11 16 15 31 30 35 34) (20 10 1) simpleGrading (0.1 1 1)
    hex (13 12 15 14 32 31 34 33) (100 10 1) simpleGrading (1 1 1)
    hex (14 15 18 17 33 34 37 36) (100 100 1) simpleGrading (1 1 1)
    hex (15 9 8 18 34 28 27 37) (10 100 1) simpleGrading (1 1 1)
);

edges
(
    arc 0 5 (0.469846 0.17101 -0.5)
    arc 5 10 (0.17101 0.469846 -0.5)
    arc 1 4 (0.939693 0.34202 -0.5)
    arc 4 9 (0.34202 0.939693 -0.5)
    arc 19 24 (0.469846 0.17101 0.5)
    arc 24 29 (0.17101 0.469846 0.5)
    arc 20 23 (0.939693 0.34202 0.5)
    arc 23 28 (0.34202 0.939693 0.5)
    arc 11 16 (-0.469846 0.17101 -0.5)
    arc 16 10 (-0.17101 0.469846 -0.5)
    arc 12 15 (-0.939693 0.34202 -0.5)
    arc 15 9 (-0.34202 0.939693 -0.5)
    arc 30 35 (-0.469846 0.17101 0.5)
    arc 35 29 (-0.17101 0.469846 0.5)
    arc 31 34 (-0.939693 0.34202 0.5)
    arc 34 28 (-0.34202 0.939693 0.5)
);

boundary
(
    down
    {
        type patch;
        faces
        (
            (0 1 20 19)
            (1 2 21 20)
            (12 11 30 31)
            (13 12 31 32)
        );
    }
    right
    {
        type patch;
        faces
        (
            (2 3 22 21)
            (3 6 25 22)
        );
    }
    up
    {
        type patch;
        faces
        (
            (7 8 27 26)
            (6 7 26 25)
            (8 18 37 27)
            (18 17 36 37)
        );
    }
    left
    {
        type patch;
        faces
        (
            (14 13 32 33)
            (17 14 33 36)
        );
    }
    cylinder
    {
        type patch;
        faces
        (
            (10 5 24 29)
            (5 0 19 24)
            (16 10 29 35)
            (11 16 35 30)
        );
    }
    z1noc
    {
        type patch;
        faces
        (
            (0 5 4 1)
            (5 10 9 4)
            (10 16 15 9)
            (16 11 12 15)
            (12 13 14 15)
            (15 14 17 18)
            (15 18 8 9)
            (9 8 7 4)
            (4 7 6 3)
            (1 4 3 2)
        );
    }
    z2noc
    {
        type patch;
        faces
        (
            (19 20 23 24)
            (24 23 28 29)
            (29 28 34 35)
            (35 34 31 30)
            (31 34 33 32)
            (34 37 36 33)
            (34 28 27 37)
            (28 23 26 27)
            (23 22 25 26)
            (20 21 22 23)
       );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
